
/*********************************************************************************************
程序名： 　　 LCD-1602显示函数
编写人： 　　 Jaden
编写时间：　　2018年8月29日
硬件支持：　　STC12C2052AD 12MHz
接口说明：　　  
修改日志：　　
　　NO.1-								
/*********************************************************************************************
说明：

/*********************************************************************************************/#include<reg52.h>
#include<reg52.h>
#define uchar unsigned char
#define uint unsigned int

#define LCD  P0
sbit LCD_RD = P2^6;		//数据/命令操作
sbit LCD_WR = P2^5;		//读/写操作
sbit LCD_EN = P2^7;	//使能操作




void LCD_init();
void DELAY_MS(uint T);
void LCD_write_data(uchar cmd);
void LCD_write_cmd(uchar cmd);
uchar LCD_read_bit_Busy(void);
void LCD_write_str(uchar x,uchar y, uchar *str);
/*********************************************************************************************
函数名：毫秒级CPU延时函数
调  用：DELAY_MS (?);
参  数：1~65535（参数不可为0）
返回值：无
结  果：占用CPU方式延时与参数数值相同的毫秒时间
备  注：应用于1T单片机时i<600，应用于12T单片机时i<125
/*********************************************************************************************/
void DELAY_MS(uint T)
{
	uint i;
	while(T-- !=0)	
	{
		for(i=0; i<600; i++);
	}
}

/*********************************************************************************************
函数名：LCD-1602初始化函数
调  用：LCD_init()
参  数: 无
返回值：无
结  果：
备  注：
/*********************************************************************************************/
void LCD_init()
{
	LCD_write_cmd(0x38);		//16*2 显示，5*7 点阵，8 位数据接口
	LCD_write_cmd(0x0C);		//显示器开，光标关闭
	LCD_write_cmd(0x06);		//文字不动，地址自动+1
	LCD_write_cmd(0x01);		//清屏
	DELAY_MS(5);


}
/*********************************************************************************************
函数名：LCD-1602写指令
调  用：LCD_write_cmd(uchar cmd)
参  数: 写入指令
返回值：无
结  果：
备  注：
/*********************************************************************************************/
void LCD_write_cmd(uchar cmd)
{
	
	LCD_EN=0;			//使能端拉低
	LCD_RD=0;			//1数据，0指令
	LCD_WR=0;			//1读操作，0写操作
	LCD=cmd;			//将数据摆放上对应的PIO口
	LCD_EN=1;			//使能端拉高	
	DELAY_MS(1);	//延时1ms左右
	LCD_EN=0;			//使能端拉低



}
/*********************************************************************************************
函数名：LCD-1602写指数据
调  用：LCD_write_data(uchar dat)
参  数: 写入指令
返回值：无
结  果：
备  注：
/*********************************************************************************************/
void LCD_write_data(uchar dat)
{
	LCD_EN=0;			//使能端拉低
	LCD_RD=1;			//1数据，0指令
	LCD_WR=0;			//1读操作，0写操作
	LCD=dat;			//将数据摆放上对应的PIO口
	LCD_EN=1;			//使能端拉高	
	DELAY_MS(1);	//延时1ms左右
	LCD_EN=0;			//使能端拉低


}

/*********************************************************************************************
函数名：LCD-1602读状态
调  用：uchar LCD_read_state(void)
参  数: 读状态
返回值：返回状态位
结  果：
备  注：
/*********************************************************************************************/
uchar LCD_read_bit_Busy(void)
{
	bit busy_flag =0;
	LCD_EN=0;			//使能端拉低
	LCD_RD=0;			//1数据，0指令
	LCD_WR=1;			//1读操作，0写操作
	LCD_EN=1;			//使能端拉高
	busy_flag =(bit)(P0 & 0x80);//获取高位状态，如果为1，标示忙。	
	DELAY_MS(1);	//延时1ms左右
	LCD_EN=0;			//使能端拉低
	return busy_flag;	//返回状态位

}

/*********************************************************************************************
函数名：LCD-1602写入字节
调  用：LCD_write_str(uchar x,uchar y, uchar dat)
参  数: 读状态
返回值：返回状态位
结  果：
备  注：
/*********************************************************************************************/
void LCD_write_str(uchar x,uchar y, uchar *str)
{
	uchar addr;
	if( LCD_read_bit_Busy()!=1)
	{
		if(x==1)
		{
			addr=0x00+y;	
		}
		if(x==2)
		{
			addr=0x40+y;
		}
		LCD_write_cmd(addr|0x80);
		while(*str!='\0')
		{
			LCD_write_data(*str++);	
		}
	}
}

/*********************************************************************************************
函数名：主函数
调  用：main(void)
参  数: 
返回值：
结  果：
备  注：
/*********************************************************************************************/

main(void)
{
	LCD_init();
	DELAY_MS(200);
	LCD_write_str(1,1,"Huang Hai Yuan");
	LCD_write_str(2,2,"I Love You!");
	while(1);
	
}
