/*********************************************************************************************
程序名： 　　 51串口测试
编写人： 　　 Jaden
编写时间：　　2018 年 08月 21日
硬件支持：　　STC90C52  12MHz
接口说明：　　  
修改日志：　　
　　NO.1-								
/*********************************************************************************************
说明：

/*********************************************************************************************/

#include<reg52.h>
#define uint unsigned int 
#define uchar unsigned char

void DELAY_MS(uint T);
void LED_Display(uchar number);
void init_serial();
uchar number;
uchar KEY;

sbit key_1=P1^0;
sbit key_2=P1^1;
sbit key_3=P1^2;
uchar code LED_CODE[]={	0x3f,0x06,0x5b,0x4f,
                        0x66,0x6d,0x7d,0x07,
                        0x7f,0x6f,0x77,0x7c,
                        0x39,0x5e,0x79,0x71
					  };

/*********************************************************************************************
函数名：毫秒级CPU延时函数
调  用：DELAY_MS (?);
参  数：1~65535（参数不可为0）
返回值：无
结  果：占用CPU方式延时与参数数值相同的毫秒时间
备  注：应用于1T单片机时i<600，应用于12T单片机时i<125
/*********************************************************************************************/
void DELAY_MS(uint T)
{
	uint i;
	while(T--!=0)
	{
		for(i=0;i<600;i++);
	}
}

/*********************************************************************************************
函数名：LED灯显示函数
调  用：LED_Display(uchar number)
参  数：无
返回值：无
结  果：
备  注：
/**********************************************************************************************/
void LED_Display(uchar number)
{
	P0=LED_CODE[number];
}
/*********************************************************************************************
函数名：串口初始化函数
调  用：init_Serial()；
参  数：无
返回值：无
结  果：
备  注：
/**********************************************************************************************/
void init_Serial()
{
	TMOD=0x20;
	TH1=0xfd;
	TL1=0xf9;
	TR1=1;
	SM0=0;
	SM1=1;
	SM2=0;
	REN=1;
	RI=0;
	EA=1;
	ES=1;
}
/*********************************************************************************************
函数名：串口中断入口函数
调  用：无
参  数：无
返回值：无
结  果：
备  注：
/**********************************************************************************************/
void Serial_interrupt() interrupt 4
{
	KEY=SBUF;
	RI=0;
	number=KEY;
	
}
/*********************************************************************************************
函数名：主函数
调  用：无
参  数：无
返回值：无
结  果：程序开始处，无限循环
备  注：
/**********************************************************************************************/
void main()
{
	init_Serial();
	while(1)
	{
		DELAY_MS(10);
		LED_Display(number);
		if(key_1==0)
		{
			DELAY_MS(10);
			if(key_1==0);
			{

				SBUF=1;
				while(!TI);
     			TI = 0;
			}
		}
		if(key_2==0)
		{
			DELAY_MS(10);
			if(key_2==0);
			{

				SBUF=2;
				while(!TI);
     			TI = 0;
			}
		}
		if(key_3==0)
		{
			DELAY_MS(10);
			if(key_3==0);
			{

				SBUF=3;
				while(!TI);
     			TI = 0;
			}
		}
	}
}
