/*********************************************************************************************
程序名： 　　 AD/DA转换函数
编写人： 　　 Jaden
编写时间：　　2018年9月03日
硬件支持：　　STC12C2052AD 12MHz
接口说明：　　  
修改日志：　　
　　NO.1-								
/*********************************************************************************************
说明：

/*********************************************************************************************/
#include<reg51.h>
#define uchar unsigned char
#define uint unsigned int

uchar AD_read_start(void);
void AD_write_start(void);
void I2C_send_ask(uchar A);
uchar I2C_read_dat(void);
void I2C_send_dat(uchar dat);
void I2C_stop();
void I2C_start();
void DELAY_US(uint T);
void DELAY_MS(uint T);
void DA_start(uchar DA_Number);

uchar unmber1, number2;
uint AD_Number;

sbit I2C_SDA = P2^0;
sbit I2C_SCL = P2^1;
/*********************************************************************************************
函数名：毫秒级CPU延时函数
调  用：DELAY_MS (?);
参  数：1~65535（参数不可为0）
返回值：无
结  果：占用CPU方式延时与参数数值相同的毫秒时间
备  注：应用于1T单片机时i<600，应用于12T单片机时i<125
/*********************************************************************************************/
void DELAY_MS(uint T)
{
	uchar i;
	while(T-- !=0)
	{
		for(i=0;i<600;i++);
	}
}

/*********************************************************************************************
函数名：微秒级CPU延时函数
调  用：DELAY_US (?);
参  数：1~65535（参数不可为0）
返回值：无
结  果：占用CPU方式延时与参数数值相同的毫秒时间
备  注:
/*********************************************************************************************/
void DELAY_US(uint T)
{
	while(T-- !=0);
}

/*********************************************************************************************
函数名：I2C开启函数
调  用：I2C_start();
参  数：
返回值：无
结  果：
备  注：
/*********************************************************************************************/
void I2C_start()
{
	I2C_SDA =1;
	DELAY_US(4);
	I2C_SCL =1;
	DELAY_US(4);
	I2C_SDA =0;
	DELAY_US(4);
}

/*********************************************************************************************
函数名：I2C关闭函数
调  用：I2C_stop();
参  数：
返回值：无
结  果：
备  注：
/*********************************************************************************************/
void I2C_stop()
{
	I2C_SDA =0;
	DELAY_US(4);
	I2C_SCL =1;
	DELAY_US(4);
	I2C_SDA =1;
	DELAY_US(4);
}

/*********************************************************************************************
函数名：I2C发送数据
调  用：I2C_send_byte(uchar dat);
参  数：
返回值：
结  果：
备  注：
/*********************************************************************************************/
void I2C_send_dat(uchar dat)
{
	uchar i,j;
	I2C_SCL =0;
	for(i=0;i<8;i++)
	{

		I2C_SDA =(bit)(dat & 0x80);
		dat=dat<<1;
		I2C_SCL =1;
		DELAY_US(4);
		I2C_SCL=0;
		DELAY_US(4);
	}
	I2C_SDA=1;
	DELAY_US(4);
	I2C_SCL=1;
	DELAY_US(4);
	j = 0;
	while(I2C_SDA==1 && j<200) j++;
	DELAY_US(4);
	I2C_SCL=0;
	DELAY_US(4);
}
/*********************************************************************************************
函数名：I2C读数据
调  用：uchar I2C_read_dat(void);
参  数：
返回值：无
结  果：
备  注：
/*********************************************************************************************/
uchar I2C_read_dat(void)
{
	uchar i,rdat;
	rdat=0x00;
	I2C_SDA=1;
	for(i=0;i<8;i++)
	{
		I2C_SCL=0;		
		rdat=rdat<<1;
		DELAY_US(4);
		I2C_SCL=1;
		DELAY_US(4);
		if(I2C_SDA==1)
		{
			rdat = rdat|0x01;
		}
		I2C_SCL=0;
		DELAY_US(4);
	}
	return rdat;
}

/*********************************************************************************************
函数名：发送应答位:1标示发送应答，0标示不发送应答；
调  用：I2C_send_ask(uchar A)
参  数：
返回值：无
结  果：
备  注：
/*********************************************************************************************/
void I2C_send_ask(uchar A)
{
	if(A==0)
	{
		I2C_SDA=1;
		DELAY_US(4);
		I2C_SCL=1;
		DELAY_US(4);
		I2C_SCL=0;
		DELAY_US(4);
	}else
	{

		I2C_SDA=0;
		DELAY_US(4);
		I2C_SCL=1;
		DELAY_US(4);
		I2C_SCL=0;
		DELAY_US(4);
	}

	
}

/*********************************************************************************************
函数名：开启AD转换
调  用：AD_write_start(void);
参  数：
返回值：无
结  果：
备  注：
/*********************************************************************************************/
void AD_write_start(void)
{
	I2C_start();
	I2C_send_dat(0x90);
	I2C_send_dat(0x40);
	I2C_stop();
}

/*********************************************************************************************
函数名：开启AD转换
调  用：uchar AD_write_start(void);
参  数：
返回值：无
结  果：
备  注：
/*********************************************************************************************/
uchar AD_read_start(void)
{
	I2C_start();
	I2C_send_dat(0x91);
	unmber1=I2C_read_dat();
	I2C_send_ask(1);
	I2C_stop();
	return(unmber1);
}


/*********************************************************************************************
函数名：开启DA转换
调  用：DA_start(uchar D);
参  数：
返回值：无
结  果：
备  注：
/*********************************************************************************************/
void DA_start(uchar DA_Number)
{
	I2C_start();
	I2C_send_dat(0x90);
	I2C_send_dat(0x40);
	I2C_send_dat(DA_Number);
	I2C_stop();
	
}


/*********************************************************************************************
函数名：main()
调  用：
参  数：
返回值：
结  果：
备  注：
/*********************************************************************************************/

void main()
{
	while(1)
	{	
	//DA转换
	//DA_start(0Xaa);

	//AD转换AIN0
	AD_write_start();
	AD_Number=AD_read_start();
	P0=AD_Number;
	DELAY_MS(100);

	}

}
