/*********************************************************************************************
程序名： 　　 LED流水灯展示
编写人： 　　 Jaden
编写时间：　　2018 年 08月 16日
硬件支持：　　STC90C52  12MHz
接口说明：　　  
修改日志：　　
　　NO.1-								
/*********************************************************************************************
说明：

/*********************************************************************************************/
#include <reg52.h>
#define uint unsigned int 
#define uchar unsigned char

void DELAY_MS(uint t);
uint keyscan();
void leddisplay();

uint number;

/*********************************************************************************************
函数名：毫秒级CPU延时函数
调  用：void leddisplay();
参  数：无
返回值：无
结  果：
备  注：
/*********************************************************************************************/
void leddisplay()
{
	P0=0XF0;
}


/*********************************************************************************************
函数名：毫秒级CPU延时函数
调  用：void keyscane();
参  数：无
返回值：无
结  果：
备  注：
/*********************************************************************************************/
uint keyscane()
{
	uchar key,b;
	P1=0xf0;
	key=P0;
	if((key!=0xf0))
	{	
		DELAY_MS(100);
		key=P1;
		if(key!=0xf0)
		{
			switch(key)
			{
			   case 0xee: b = 1; break;
			   case 0xed: b = 2; break;
			   case 0xeb: b = 3; break;
			   case 0xe7: b = 4; break;
			   case 0xde: b = 5; break;
			   case 0xdd: b = 6; break;
			   case 0xdb: b = 7; break;
			   case 0xd7: b = 8; break;
			   case 0xbe: b = 9; break;
			   case 0xbd: b = 10; break;
			   case 0xbb: b = 11; break;
			   case 0xb7: b = 12; break;
			   case 0x7e: b = 13; break;
			   case 0x7d: b = 14; break;
			   case 0x7b: b = 15; break;
			   case 0x77: b = 16; break;
			   default:   b = 0 ; break;
	   		}	
		
			
		}
		return(b);
		
	}
	
}


/*********************************************************************************************
函数名：毫秒级CPU延时函数
调  用：DELAY_MS (?);
参  数：1~65535（参数不可为0）
返回值：无
结  果：占用CPU方式延时与参数数值相同的毫秒时间
备  注：应用于1T单片机时i<600，应用于12T单片机时i<125
/*********************************************************************************************/
void DELAY_MS(uint t)
{

	uint i;
	while(t--!=0)
	{
		for(i=600;i>0;i--);
	}
}

/*********************************************************************************************
函数名：主函数
调  用：无
参  数：无
返回值：无
结  果：程序开始处，无限循环
备  注：
/**********************************************************************************************/
void main()
{

	while(1)
	{
		number=keyscane();
		if(number==3)
		{
			P0=0x10;
		}
		if(number==1)
		{
			P0=0x20;
		}
		if(number==2)
		{
			P0=0x40;
		}
	}
}
